Tekla Open API Reference for Tekla Structures 2025
Angle.CurrentUnitValue Property
 Gets the value of the angle in the current unit
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double CurrentUnitValue { get; }
Public ReadOnly Property CurrentUnitValue As Double
	Get
Property Value
Type: Double
See Also
Reference
Angle Class
Tekla.Structures.Datatype Namespace